{
  "backend/main.mo": "Motoko backend actor defining admin login, access control, storage mixins, and all data types and maps for clients, transporters, loads, and tracking.",
  "feature_evidence.json": "JSON report mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "List of concise summaries for many frontend files describing their roles in routing, UI, auth, forms, and load management.",
  "frontend/.gitignore": "Git ignore rules for node modules, build artifacts, IDE files, Capacitor outputs, and Android signing files.",
  "frontend/ADMIN_ACCESS.md": "Documentation explaining password-based admin authentication, token flow, route protection, and backend integration.",
  "frontend/ANDROID_BUILD.md": "Guide for building Android APK/AAB files and preparing them for Play Store publishing, including prerequisites and steps.",
  "frontend/capacitor.config.ts": "Capacitor configuration defining app IDs, build directories, Android HTTPS scheme, and keystore-based signing options.",
  "frontend/index.css": "Tailwind CSS base file defining theme variables, dark mode styles, and shared utility customizations.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/scripts/android/_signing-env.example": "Template environment file showing required variables for Android signing credentials.",
  "frontend/scripts/android/build-debug-apk.sh": "Builds a debug Android APK by validating prerequisites, building the web app, syncing Capacitor, and running Gradle assembleDebug.",
  "frontend/scripts/android/build-release-aab.sh": "Builds a signed release AAB for Play Store upload, checking signing env vars and running Gradle bundleRelease.",
  "frontend/scripts/android/build-release-apk.sh": "Builds a signed release APK for distribution outside Play Store using provided keystore credentials.",
  "frontend/src/App.tsx": "Sets up the app with React Query, theme provider, router, and global toast notifications.",
  "frontend/src/components/admin/AdminAssignTransporterControl.tsx": "Provides a dropdown UI for assigning verified transporters to a load using backend mutations.",
  "frontend/src/components/admin/AdminAssignTransportersSection.tsx": "Displays pending and approved loads in tabbed tables, each with controls to assign transporters.",
  "frontend/src/components/admin/AdminClientDetailsDialog.tsx": "Dialog for viewing and editing client details, updating verification status, and deleting clients.",
  "frontend/src/components/admin/AdminContactMessageDetailsDialog.tsx": "Dialog for viewing contact message details and deleting the message via backend mutation.",
  "frontend/src/components/admin/AdminContractsSection.tsx": "Displays a table of client-posted contracts with text, year, and formatted start/end dates, fetched via useGetContracts().",
  "frontend/src/components/admin/AdminLoadDetailsDialog.tsx": "Provides a dialog for admins to view, update, approve/reject, or delete a specific load, including editing price and assigning clients or transporters.",
  "frontend/src/components/admin/AdminOperationsTabs.tsx": "Renders the main admin panel with tabs for clients, transporters, pending and approved loads, contacts, contracts, pricing, and related detail dialogs.",
  "frontend/src/components/admin/AdminPricesSection.tsx": "Manages load pricing configurations, allowing admins to add, edit, and delete rate entries via dialogs.",
  "frontend/src/components/admin/AdminTransporterDetailsDialog.tsx": "Dialog for viewing and editing transporter details, updating verification status, or deleting the transporter.",
  "frontend/src/components/admin/AdminYearsManagementSection.tsx": "Allows admins to add or remove available years for contract selection and displays the current sorted list of years.",
  "frontend/src/components/admin/LocationEvidenceViewer.tsx": "Fetches and displays transporter-submitted location evidence with timestamps, coordinates, and image previews.",
  "frontend/src/components/admin/TransporterLocationList.tsx": "Shows a detailed list of transporters with contact info, truck type, live location, and status freshness indicators.",
  "frontend/src/components/admin/TransporterLocationsFilters.tsx": "Provides filters for hiding transporters without locations and selecting by truck type.",
  "frontend/src/components/admin/TransporterLocationsMapView.tsx": "Displays transporters with location data in a simple grid-based map view with expandable details.",
  "frontend/src/components/admin/TransporterLocationsTab.tsx": "Combines filters, map view, and list view to manage and display transporter locations and statuses.",
  "frontend/src/components/ads/AdSnippetPreviewFrame.tsx": "Renders an ad snippet inside an iframe with load/error detection and optional diagnostics overlay.",
  "frontend/src/components/ads/BottomAd.tsx": "Displays a dismissible bottom advertisement using stored settings and an iframe preview.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with support contact info and buttons to return home or go to admin login.",
  "frontend/src/components/auth/AdminContactMessageDetailsDialog.tsx": "Shows a dialog with detailed contact message info and placeholder delete functionality.",
  "frontend/src/components/auth/AdminRouteErrorBoundary.tsx": "Error boundary that catches admin route errors and offers retry by invalidating auth-related queries.",
  "frontend/src/components/auth/AdminRouteErrorState.tsx": "Presents an admin access error screen with retry and sign‑out actions that clear auth state.",
  "frontend/src/components/auth/AdminSignInPrompt.tsx": "Prompts users to sign in with admin credentials and provides a support contact link.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout with loading states and optional post‑login callback.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for new users to enter name and email and submit a profile creation request.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Protects admin routes by verifying admin status, handling errors, and redirecting unauthorized users.",
  "frontend/src/components/control-center/AppConfigurationSection.tsx": "Admin section for editing the Android APK download link and managing ad settings.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with company info, navigation links, regional coverage, and attribution link.",
  "frontend/src/components/layout/SiteLayout.tsx": "Root page layout rendering the top navigation, main content outlet, bottom ad, and footer.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar with links, login handling, admin options, and responsive mobile menu.",
  "frontend/src/components/loads/LoadInterestEvidenceDialog.tsx": "Dialog for capturing geolocation and uploading a screenshot as evidence when expressing load interest.",
  "frontend/src/components/loads/LoadLocations.tsx": "Displays pickup and drop-off locations with icons if provided.",
  "frontend/src/components/transporter/LiveLocationToggleCard.tsx": "Card allowing transporters to start or stop live location sharing with status and error indicators.",
  "frontend/src/components/transporter/TransporterStatusCard.tsx": "Card for viewing and updating transporter operational status with validation and mutation handling.",
  "frontend/src/config/adminBootstrap.ts": "Provides functions to read and compare the bootstrap admin principal from environment variables.",
  "frontend/src/config/ads.ts": "Defines ad configuration and utilities for loading and saving bottom ad settings in localStorage.",
  "frontend/src/config/download.ts": "Reads a fallback Android APK download URL from environment variables.",
  "frontend/src/constants/adminToken.ts": "Exports constants for admin token storage and change event names.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor based on Internet Identity and initializes admin access.",
  "frontend/src/hooks/useAdminAccess.ts": "Hooks for granting admin access and performing bootstrap admin assignment with query invalidations.",
  "frontend/src/hooks/useAdminToken.ts": "Tracks the admin token from sessionStorage and updates reactively via a custom event listener.",
  "frontend/src/hooks/useAdminVerification.ts": "Provides functions and a hook to verify admin access by initializing the actor with a token and checking admin status.",
  "frontend/src/hooks/useAuth.ts": "Aggregates identity, user profile, role, and admin checks to provide overall authentication and state flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context, loading identities, handling login/logout, and exposing auth state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend interactions including contact, admin verification, client data, and other domain operations.",
  "frontend/src/hooks/useTransporterLiveLocation.ts": "Manages live geolocation updates for transporters, periodically sending location to the backend with error handling.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and update the caller’s user profile and role using authenticated actor calls.",
  "frontend/src/index.css": "Tailwind CSS setup defining design tokens, dark mode variables, and base/reset styles.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, and the Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders an about page detailing company story, mission, values, and regional coverage with styled cards.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Displays the admin dashboard with sign‑out handling and tabs for managing platform operations.",
  "frontend/src/pages/AdminPasswordLoginPage.tsx": "Implements admin password login with token storage, actor reinitialization, and admin access verification.",
  "frontend/src/pages/ClientRegistrationPage.tsx": "Provides a client registration form that loads existing data, submits registration, and shows verification status.",
  "frontend/src/pages/ContactPage.tsx": "Contains a contact form that sends user messages and displays company contact information.",
  "frontend/src/pages/ContractsPage.tsx": "Allows verified users to post and browse contracts, including year filtering and validation logic.",
  "frontend/src/pages/ControlCenterPage.tsx": "Admin-only page showing app configuration settings and platform management tabs, wrapped in admin auth and error boundaries.",
  "frontend/src/pages/DownloadPage.tsx": "Displays Android APK download link using backend or fallback URL with loading and error states.",
  "frontend/src/pages/HomePage.tsx": "Public landing page with hero section, company info, testimonials, and CTAs for clients and transporters.",
  "frontend/src/pages/LoadBoardPage.tsx": "Authenticated load board for viewing transporter loads and posting new loads with validation and API integration.",
  "frontend/src/pages/ServicesPage.tsx": "Lists platform services and explains the workflow for posting and matching freight loads.",
  "frontend/src/pages/TransporterRegistrationPage.tsx": "Form for transporters to register or edit details with document upload, contract info, and verification handling.",
  "frontend/src/routeTree.tsx": "Defines the TanStack Router route tree, mapping all app pages including Control Center and admin routes using hash-based routing.",
  "frontend/src/utils/csv.ts": "Provides a utility to convert an array of objects into CSV format and trigger a browser download.",
  "frontend/src/utils/urlParams.ts": "Implements helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, fonts, animations, and plugins like typography and container queries.",
  "project_state.json": "Describes current project state, known issues, and feature requests focused on building an in-app Control Center to replace the missing admin panel."
}