{
  "backend/main.mo": "Main backend canister defining admin login, access control, storage mixins, and data models for clients, transporters, loads, tracking, and verification.",
  "backend/migration.mo": "Migration module that defines old/new actor types and performs a no-op migration by returning the old state unchanged.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to involved files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for numerous frontend source files.",
  "frontend/.gitignore": "Git ignore rules for dependencies, build artifacts, environment files, IDE configs, and Capacitor folders.",
  "frontend/ADMIN_ACCESS.md": "Documentation explaining the password-based admin auth system, token flow, route protection, and backend integration.",
  "frontend/ANDROID_BUILD.md": "Guide for building Android APK/AAB files and preparing them for Play Store publishing.",
  "frontend/capacitor.config.ts": "Capacitor configuration defining app metadata, web output dir, HTTPS scheme, and Android keystore build options.",
  "frontend/index.css": "Tailwind CSS base file defining custom theme variables and dark mode overrides.",
  "frontend/index.html": "Basic HTML entry point containing root div and script loading the main React bundle.",
  "frontend/scripts/android/_signing-env.example": "Example environment file showing Android signing variable names for release builds.",
  "frontend/scripts/android/build-debug-apk.sh": "Builds a debug Android APK by checking prerequisites, building the web app, syncing Capacitor, and running Gradle assembleDebug.",
  "frontend/scripts/android/build-release-aab.sh": "Builds a signed release AAB for Play Store upload using provided keystore credentials and Gradle bundleRelease.",
  "frontend/scripts/android/build-release-apk.sh": "Builds a signed release APK for external distribution using keystore credentials and Gradle assembleRelease.",
  "frontend/src/App.tsx": "Sets up the app with React Query, theme provider, router, and UI toaster.",
  "frontend/src/components/admin/LocationEvidenceViewer.tsx": "Displays a transporter’s submitted location evidence with timestamps, coordinates, and screenshot viewer.",
  "frontend/src/components/admin/TransporterLocationList.tsx": "Renders a list of transporters with details, live location info, status, and freshness indicators.",
  "frontend/src/components/admin/TransporterLocationsFilters.tsx": "Provides filters for transporter list, including hiding those without location and filtering by truck type.",
  "frontend/src/components/admin/TransporterLocationsMapView.tsx": "Shows a simple map-style list of transporters with location data, allowing marker selection for details.",
  "frontend/src/components/admin/TransporterLocationsTab.tsx": "Displays transporter locations with filters, map fallback handling, and a list view, using query data and memoized filtering.",
  "frontend/src/components/ads/AdSnippetPreviewFrame.tsx": "Renders an iframe preview of an ad snippet with diagnostics and error handling for load failures or empty snippets.",
  "frontend/src/components/ads/BottomAd.tsx": "Shows a bottom advertisement bar based on ad settings, supports dismissal, live settings updates, and iframe preview rendering.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Static screen informing users they lack admin access, offering navigation to home or admin login.",
  "frontend/src/components/auth/AdminRouteErrorBoundary.tsx": "Error boundary for admin routes that resets relevant queries and shows a recovery state on failure.",
  "frontend/src/components/auth/AdminRouteErrorState.tsx": "Displays an admin access error with options to retry verification or sign out and clear cached state.",
  "frontend/src/components/auth/AdminSignInPrompt.tsx": "Prompts unauthorized users to sign in with admin credentials and provides support contact info.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout flow with loading states, error recovery, and optional post-login callback.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for new users to submit name and email and create their profile, with validation and async save handling.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Guards admin-only content by verifying admin status, handling redirects, and showing loading or error states.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with company info, quick links, coverage areas, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with top navigation, routed content area, bottom ad, and footer.",
  "frontend/src/components/layout/TopNav.tsx": "Responsive top navigation bar with branding, links, login controls, and a mobile menu toggle.",
  "frontend/src/components/loads/LoadInterestEvidenceDialog.tsx": "Dialog for uploading screenshot evidence and capturing geolocation before submitting load interest evidence.",
  "frontend/src/components/loads/LoadLocations.tsx": "Displays pickup and drop-off locations with icons if provided.",
  "frontend/src/components/transporter/LiveLocationToggleCard.tsx": "Card enabling transporters to start or stop live location sharing with status indicators and last-update info.",
  "frontend/src/components/transporter/TransporterStatusCard.tsx": "Card allowing transporters to view and update their operational status with validation and mutation handling.",
  "frontend/src/config/adminBootstrap.ts": "Utilities to read and compare the bootstrap admin principal from environment variables.",
  "frontend/src/config/ads.ts": "AdMob configuration, default ad snippet, and localStorage-backed ad settings management.",
  "frontend/src/constants/adminToken.ts": "Defines shared constants for admin token storage and change events.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, initializing admin access when available and invalidating dependent queries on change.",
  "frontend/src/hooks/useAdminAccess.ts": "Provides mutations for granting or bootstrapping admin access and invalidates related admin verification queries.",
  "frontend/src/hooks/useAdminToken.ts": "Tracks the admin token from sessionStorage and updates reactively via a custom change event.",
  "frontend/src/hooks/useAuth.ts": "Combines identity, user profile, role, and admin-token checks to determine authentication state, loading state, and admin privileges.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages creation, loading, and lifecycle of Internet Identity authentication using AuthClient and provides context to the app.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for interacting with backend APIs including contact messages, admin checks, client data, and other domain operations.",
  "frontend/src/hooks/useTransporterLiveLocation.ts": "Handles geolocation tracking for transporters, periodically sending location updates to the backend with error handling.",
  "frontend/src/hooks/useUserProfile.ts": "Provides queries and mutations for fetching and saving the caller’s user profile and role, enabled only when authenticated.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for a corporate-themed light/dark color palette.",
  "frontend/src/main.tsx": "Initializes React app root and wraps App with React Query and InternetIdentity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders company About page with story, mission, values, and regional coverage details.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Implements admin dashboard with tabs for loads, users, contacts, APK link management, ads, and verification actions.",
  "frontend/src/pages/AdminPasswordLoginPage.tsx": "Provides admin login form with diagnostics, token handling, and admin verification logic.",
  "frontend/src/pages/ClientRegistrationPage.tsx": "Handles client registration form, loading existing info, and submitting registration with contract details.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact form for user messages and company contact information.",
  "frontend/src/pages/ContractsPage.tsx": "Renders a contracts dashboard allowing authenticated, verified users to create contracts and view existing ones with date validation and form handling.",
  "frontend/src/pages/HomePage.tsx": "Displays the marketing homepage with hero content, testimonials, and registration links, including optional profile setup.",
  "frontend/src/pages/LoadBoardPage.tsx": "Implements load creation and viewing for clients and transporters, including file uploads, validations, and interest submission.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a static list of logistics services and a simple “how it works” flow for users.",
  "frontend/src/pages/TransporterRegistrationPage.tsx": "Handles transporter registration and editing with document uploads, truck type selection, and contract details.",
  "frontend/src/routeTree.tsx": "Defines the application's route structure and components using TanStack Router, including public, registration, and admin pages.",
  "frontend/src/utils/csv.ts": "Exports a function that converts an array of objects into CSV text, creates a Blob, and triggers a browser file download.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, storing/retrieving them from sessionStorage, and managing persisted or hash-based parameters.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, plugins, and content scanning for the frontend project.",
  "project_state.json": "Defines the project's current state, feature requirements, known issues, and pending admin-related feature requests."
}