{
  "backend/main.mo": "Motoko canister defining admin login with credential storage plus data models and maps for clients, transporters, loads, and tracking, including authorization and blob‑storage mixins.",
  "feature_evidence.json": "Feature evidence report listing impacted frontend files, components, and test IDs for three admin‑authentication related features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of major frontend React components, hooks, pages, and layout files.",
  "frontend/.gitignore": "Git ignore rules for node modules, build outputs, environment files, IDE artifacts, and Capacitor Android/iOS paths.",
  "frontend/ADMIN_ACCESS.md": "Documentation of admin login flow, session token storage, and backend verification requirements for accessing admin routes.",
  "frontend/ANDROID_BUILD.md": "Guide for building Android APK/AAB files and preparing the app for Play Store deployment with required tools and steps.",
  "frontend/capacitor.config.ts": "Capacitor configuration specifying app metadata, web directory, HTTPS scheme, and Android keystore build options.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables and light/dark mode styles for the application UI.",
  "frontend/index.html": "Root HTML file loading the React app entry point into the #root container.",
  "frontend/scripts/android/_signing-env.example": "Template environment file showing variables required for Android release signing.",
  "frontend/scripts/android/build-debug-apk.sh": "Shell script that checks prerequisites, builds the web app, syncs Capacitor, and generates a debug Android APK.",
  "frontend/scripts/android/build-release-aab.sh": "Builds a signed Android App Bundle for Play Store, validating env vars, building the web app, syncing Capacitor, and running Gradle bundleRelease.",
  "frontend/scripts/android/build-release-apk.sh": "Builds a signed release APK for distribution, checking signing env vars, building the web app, syncing Capacitor, and running Gradle assembleRelease.",
  "frontend/src/App.tsx": "Sets up the React app with React Query, routing, theming, and a global toaster.",
  "frontend/src/components/admin/LocationEvidenceViewer.tsx": "Displays submitted location evidence for a transporter, with timestamps, coordinates, and screenshot viewing.",
  "frontend/src/components/admin/TransporterLocationList.tsx": "Renders a list of transporters with details, status, recent location data, and stale checks.",
  "frontend/src/components/admin/TransporterLocationsFilters.tsx": "Provides filters for hiding transporters without location and selecting truck type.",
  "frontend/src/components/admin/TransporterLocationsMapView.tsx": "Shows transporters with location data in a simple map-like grid and allows selecting one to view details.",
  "frontend/src/components/admin/TransporterLocationsTab.tsx": "Loads transporter data, applies filters, and displays locations via map or list with fallback handling.",
  "frontend/src/components/ads/AdSnippetPreviewFrame.tsx": "Renders an ad snippet inside an iframe with diagnostics for empty content or load errors.",
  "frontend/src/components/ads/BottomAd.tsx": "Displays a configurable bottom advertisement with dismissal and live settings updates.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access denied message with options to return home or log in as admin.",
  "frontend/src/components/auth/AdminRouteErrorBoundary.tsx": "Error boundary for admin routes that resets admin queries and shows a recovery UI.",
  "frontend/src/components/auth/AdminRouteErrorState.tsx": "Displays admin access error with retry and sign-out options.",
  "frontend/src/components/auth/AdminSignInPrompt.tsx": "Prompts users to sign in with admin credentials to access restricted areas.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles user login/logout using Internet Identity with loading and error recovery.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for creating a basic user profile with name and email submission.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Protects admin routes by verifying admin status, handling redirects, and showing error or loading states.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with links, coverage areas, and a dynamic year plus a caffeine.ai attribution link.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout combining top navigation, routed content, bottom ad, and footer.",
  "frontend/src/components/layout/TopNav.tsx": "Implements the responsive top navigation bar with links, login handling, and mobile menu toggling.",
  "frontend/src/components/loads/LoadInterestEvidenceDialog.tsx": "Provides a dialog for uploading location evidence, including geolocation capture and image validation.",
  "frontend/src/components/loads/LoadLocations.tsx": "Displays pickup and drop-off locations with icons when available.",
  "frontend/src/components/transporter/LiveLocationToggleCard.tsx": "Shows live location sharing status and enables transporters to start or stop sharing their real-time location.",
  "frontend/src/components/transporter/TransporterStatusCard.tsx": "Allows transporters to view and update their operational status with validation and timestamp formatting.",
  "frontend/src/config/adminBootstrap.ts": "Handles retrieval and comparison of the optional bootstrap admin principal from environment variables.",
  "frontend/src/config/ads.ts": "Stores ad configuration, default ad snippet, and utilities for loading and saving ad display settings.",
  "frontend/src/constants/adminToken.ts": "Defines shared constants for storing and tracking admin token changes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAccess.ts": "Provides mutations to assign admin roles and bootstrap admin access, invalidating related role and profile queries.",
  "frontend/src/hooks/useAdminToken.ts": "Tracks the admin token from sessionStorage and updates reactively when it changes via custom events.",
  "frontend/src/hooks/useAuth.ts": "Aggregates identity, admin token, profile, role, and admin checks to compute authentication and authorization state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, and persisted identity loading.",
  "frontend/src/hooks/useQueries.ts": "Contains react-query hooks for backend operations such as contact messages, admin checks, client data, transporter data, and more.",
  "frontend/src/hooks/useTransporterLiveLocation.ts": "Handles periodic geolocation updates for transporters, sending location data to the backend and managing errors and state.",
  "frontend/src/hooks/useUserProfile.ts": "Provides queries and mutations for fetching and updating the caller's user profile and role.",
  "frontend/src/index.css": "Defines Tailwind base styles and a corporate color palette for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company story, mission, values, and regional coverage using styled cards and icons.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Implements the admin dashboard with tabs for loads, transporters, clients, contacts, ads, and APK management using multiple data-fetching hooks.",
  "frontend/src/pages/AdminPasswordLoginPage.tsx": "Provides an admin login form that authenticates via actor.adminLogin, stores a token, and verifies admin status before redirecting.",
  "frontend/src/pages/ClientRegistrationPage.tsx": "Handles client registration with form fields, existing info loading, contract submission, and verification status display.",
  "frontend/src/pages/ContactPage.tsx": "Displays a contact form that submits messages to the backend and shows company contact information.",
  "frontend/src/pages/ContractsPage.tsx": "Renders a contracts dashboard allowing authenticated, verified users to post contracts and view existing ones, handling validation and submission via API hooks.",
  "frontend/src/pages/HomePage.tsx": "Displays the landing page with hero content, marketing sections, and calls to action for client and transporter registration.",
  "frontend/src/pages/LoadBoardPage.tsx": "Provides a load board for clients to post loads and transporters to browse them, including file uploads, verification checks, and API-driven load actions.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a static services overview with descriptions of logistics offerings and a simple process explanation.",
  "frontend/src/pages/TransporterRegistrationPage.tsx": "Implements transporter registration and profile editing with document uploads, contract details, and truck type selection.",
  "frontend/src/routeTree.tsx": "Defines the application’s route structure using TanStack Router, mapping URLs to page components and configuring hash-based navigation.",
  "frontend/src/utils/csv.ts": "Converts an array of objects into CSV text, creates a Blob, and triggers a browser download with escaped values.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using both query and hash routes plus sessionStorage.",
  "frontend/tailwind.config.js": "Defines Tailwind theme extensions, colors, fonts, animations, and includes typography, container‑queries, and animate plugins.",
  "project_state.json": "Tracks project state, issues, and feature requirements related to fixing admin login and dashboard access flow."
}