{
  "backend/main.mo": "Backend canister defining admin login with hardcoded credentials and a full trucking domain model including clients, transporters, loads, tracking, and storage mixins.",
  "feature_evidence.json": "Feature evidence report listing admin‑login related fixes, affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Map of frontend file paths to short functional summaries describing routing, UI components, hooks, and pages.",
  "frontend/.gitignore": "Git ignore rules for dependencies, build outputs, environment files, IDE files, and Capacitor Android/iOS artifacts.",
  "frontend/ADMIN_ACCESS.md": "Documentation explaining the password‑based admin auth flow, token handling, route protection, and backend integration.",
  "frontend/ANDROID_BUILD.md": "Guide for building Android APK/AAB files and preparing the app for Play Store publishing with required tools and steps.",
  "frontend/capacitor.config.ts": "Capacitor configuration defining app metadata, web directory, and Android keystore build options.",
  "frontend/index.css": "Tailwind CSS setup with theme variables for light/dark modes and global styling rules.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/scripts/android/_signing-env.example": "Example environment variable template for Android signing credentials.",
  "frontend/scripts/android/build-debug-apk.sh": "Bash script that builds a debug Android APK, checking prerequisites, building the web app, syncing, and running Gradle.",
  "frontend/scripts/android/build-release-aab.sh": "Builds a signed Android App Bundle, validating env vars, building the web app, syncing Capacitor, and running Gradle to produce a release AAB.",
  "frontend/scripts/android/build-release-apk.sh": "Builds a signed release APK for distribution outside Play Store, performing signing checks, building the web app, syncing Capacitor, and running Gradle.",
  "frontend/src/App.tsx": "Sets up the app root with React Query, theme provider, router, and global toaster notifications.",
  "frontend/src/components/admin/LocationEvidenceViewer.tsx": "Displays submitted location evidence for a transporter, including timestamps, coordinates, and screenshot viewing via a dialog.",
  "frontend/src/components/admin/TransporterLocationList.tsx": "Renders a list of transporters with details, live location info, truck type, and status, including timestamp formatting and stale checks.",
  "frontend/src/components/admin/TransporterLocationsFilters.tsx": "Provides filters for transporter listings, including toggling visibility for missing locations and selecting truck types.",
  "frontend/src/components/admin/TransporterLocationsMapView.tsx": "Shows transporters with locations using a simple grid-based map-style layout, including selection and detailed info display.",
  "frontend/src/components/admin/TransporterLocationsTab.tsx": "Displays transporter locations with filters, a map view fallback, and a list view while handling loading and error states.",
  "frontend/src/components/ads/AdSnippetPreviewFrame.tsx": "Renders an iframe preview of an ad snippet with load/error diagnostics and fallback messaging for empty snippets.",
  "frontend/src/components/ads/BottomAd.tsx": "Shows a dismissible bottom-page ad that loads dynamic settings and renders an ad snippet preview or an empty state message.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with support contact info and navigation options for home or admin login.",
  "frontend/src/components/auth/AdminRouteErrorBoundary.tsx": "Error boundary for admin routes that resets queries and shows a retry state when admin verification fails.",
  "frontend/src/components/auth/AdminRouteErrorState.tsx": "Shows an admin access error with retry and sign‑out actions that clear tokens and cached queries.",
  "frontend/src/components/auth/AdminSignInPrompt.tsx": "Prompts users to sign in with admin credentials and provides contact info for access requests.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles login and logout via Internet Identity with loading states and optional post‑login callback.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for creating a basic user profile with name and email, using a save mutation and validation.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Guards admin‑only content by checking admin status, handling verification errors, and redirecting unauthorized users.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with company info, navigation links, coverage areas, and a dynamic year plus referral link.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main page layout including top navigation, routed content, bottom ad, and footer.",
  "frontend/src/components/layout/TopNav.tsx": "Implements the responsive top navigation bar with links, login controls, and mobile menu handling.",
  "frontend/src/components/loads/LoadInterestEvidenceDialog.tsx": "Provides a dialog for capturing location evidence and uploading screenshots with validation and progress tracking.",
  "frontend/src/components/loads/LoadLocations.tsx": "Displays pickup and drop-off locations with icons when available.",
  "frontend/src/components/transporter/LiveLocationToggleCard.tsx": "Shows transporter live‑location status and lets users start or stop real‑time location sharing.",
  "frontend/src/components/transporter/TransporterStatusCard.tsx": "Allows transporters to view and update their operational status with validation and error handling.",
  "frontend/src/config/adminBootstrap.ts": "Handles retrieving and validating the build‑time admin bootstrap principal from environment variables.",
  "frontend/src/config/ads.ts": "Defines ad configuration, default ad snippet, and functions to load and save ad settings in localStorage.",
  "frontend/src/constants/adminToken.ts": "Provides shared constants for admin token storage and change event names.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAccess.ts": "Provides mutation hooks for granting or bootstrapping admin access and invalidates related admin queries on success.",
  "frontend/src/hooks/useAdminToken.ts": "Tracks the admin token stored in sessionStorage and updates reactively on custom token‑change events.",
  "frontend/src/hooks/useAdminVerification.ts": "Verifies admin access by initializing the actor with the admin token and exposes a hook to trigger verification.",
  "frontend/src/hooks/useAuth.ts": "Aggregates identity, admin token, role, and profile queries to compute authentication, loading, and admin state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout functions, and manages identity loading and lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Contains various react‑query hooks for backend operations including admin checks, client management, contact messages, and transporter actions.",
  "frontend/src/hooks/useTransporterLiveLocation.ts": "Manages periodic transporter geolocation updates, handling permissions, errors, and update scheduling.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and update the caller's user profile and role, with identity‑aware query enabling.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables with global base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the company’s About page with story, mission, values, and regional coverage sections.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Implements the admin dashboard with load management, user verification, APK link settings, ads, and data tables using various queries.",
  "frontend/src/pages/AdminPasswordLoginPage.tsx": "Provides password-based admin login with diagnostic steps, token handling, and verification retry logic.",
  "frontend/src/pages/ClientRegistrationPage.tsx": "Handles client registration, form state, contract data submission, and displays verification status.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form and displays company contact information with form submission via backend.",
  "frontend/src/pages/ContractsPage.tsx": "Renders the contracts interface, allowing authenticated and verified users to post contracts and view existing ones with date validation and form handling.",
  "frontend/src/pages/HomePage.tsx": "Displays the marketing homepage with hero content, testimonials, calls to action, and optional profile setup modal.",
  "frontend/src/pages/LoadBoardPage.tsx": "Provides load posting and browsing features for clients and transporters, including file uploads, truck type selection, and interest submission.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a list of logistics services and a simple how‑it‑works section using static content.",
  "frontend/src/pages/TransporterRegistrationPage.tsx": "Handles transporter registration and editing of details, including document uploads, contract info, and truck type selection.",
  "frontend/src/routeTree.tsx": "Defines the app’s routing structure using TanStack Router, mapping all pages to their respective paths.",
  "frontend/src/utils/csv.ts": "Provides a CSV export helper that converts object arrays to CSV strings and triggers a browser download.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from hash-based URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing state, issues, and existing admin‑login–related fix features."
}