{
  "backend/main.mo": "Motoko canister implementing storage, access control, user profiles, contacts, clients, transporters, loads, and APK link management with admin‑restricted mutations.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files, components, and test IDs for admin routing and error‑handling improvements.",
  "frontend-file-summaries.txt": "List of concise summaries for all frontend source files describing their purpose and behavior.",
  "frontend/.gitignore": "Ignore rules for node modules, build outputs, IDE files, Capacitor artifacts, and Android/iOS build directories.",
  "frontend/ADMIN_ACCESS.md": "Documentation explaining the admin route access gate, related components, authentication flow, and support contact.",
  "frontend/ANDROID_BUILD.md": "Guide for building Android APK/AAB files and preparing them for Play Store publishing.",
  "frontend/capacitor.config.ts": "Capacitor configuration specifying app metadata, web directory, HTTPS Android scheme, and keystore‑based Android build options.",
  "frontend/index.css": "Tailwind base and theme definitions with light and dark OKLCH color variables and global styling rules.",
  "frontend/index.html": "Base HTML entry point defining the root container and loading the main React script.",
  "frontend/scripts/android/_signing-env.example": "Template for Android signing environment variables including keystore paths and passwords.",
  "frontend/scripts/android/build-debug-apk.sh": "Builds a debug Android APK by checking prerequisites, building the web app, syncing Capacitor, and running Gradle assembleDebug.",
  "frontend/scripts/android/build-release-aab.sh": "Builds a signed release AAB for Play Store by verifying signing env vars, building the web app, syncing Capacitor, and running Gradle bundleRelease.",
  "frontend/scripts/android/build-release-apk.sh": "Builds a signed release APK for distribution by checking signing env vars, building the web app, syncing Capacitor, and running Gradle assembleRelease.",
  "frontend/src/App.tsx": "Sets up the app’s router, React Query client, theme provider, and toast system, rendering the main application structure.",
  "frontend/src/components/ads/AdSnippetPreviewFrame.tsx": "Renders an iframe preview of an ad snippet with error handling and diagnostics overlay for failed loads.",
  "frontend/src/components/ads/BottomAd.tsx": "Displays a dismissible bottom ad using stored ad settings and an iframe preview, updating dynamically on settings changes.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access denied message with support contact info and a button to return home.",
  "frontend/src/components/auth/AdminRouteErrorBoundary.tsx": "Error boundary wrapping admin routes, showing a recovery UI when errors occur and allowing retry.",
  "frontend/src/components/auth/AdminRouteErrorState.tsx": "Displays admin access errors with retry and sign‑out options, along with troubleshooting guidance.",
  "frontend/src/components/auth/AdminSignInPrompt.tsx": "Prompts unauthorized users to sign in for admin access and redirects them post-login.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles login/logout via Internet Identity with loading states, error handling, and optional success callback.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal form that collects name and email and saves a new user profile via useSaveUserProfile.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Wrapper that checks authentication and admin role, showing loading, error, sign-in, or access-denied states before rendering children.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying company info, links, coverage areas, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout with top navigation, main content area, bottom ad, and footer.",
  "frontend/src/components/layout/TopNav.tsx": "Responsive navigation bar with desktop and mobile menus plus login button integration.",
  "frontend/src/components/loads/LoadLocations.tsx": "Displays pickup and drop-off locations with icons if provided and not marked unknown.",
  "frontend/src/config/ads.ts": "Defines ad configuration, default AdSense snippet, and helpers to load and save bottom ad settings from localStorage.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes related queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Aggregates identity, user profile, and role queries to determine authentication state, loading state, and admin access.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, handling login state, stored identities, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating backend data including contacts, clients, transporters, loads, and APK links.",
  "frontend/src/hooks/useUserProfile.ts": "Defines React Query hooks for retrieving and saving the current user's profile and role using the actor API.",
  "frontend/src/index.css": "Tailwind CSS configuration defining color variables, themes, and base utility styles for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders a static About page describing the company, mission, values, and regional coverage.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Implements the admin dashboard with load approvals, transporter and client management, contact messages, APK link updates, ads, and CSV export.",
  "frontend/src/pages/ClientRegistrationPage.tsx": "Provides a client registration and profile update form integrated with authentication and backend save/query hooks.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form that submits user inquiries via a mutation hook and displays static contact info.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with hero content, calls to action, company overview, and testimonials.",
  "frontend/src/pages/LoadBoardPage.tsx": "Provides load browsing, posting, and user-specific load views with file uploads and validation.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a list of service offerings and a brief how‑it‑works section for the platform.",
  "frontend/src/pages/TransporterRegistrationPage.tsx": "Implements transporter registration with document uploads, validation, and profile editing.",
  "frontend/src/routeTree.tsx": "Defines the application's routing structure using TanStack Router and maps routes to pages.",
  "frontend/src/utils/csv.ts": "Converts an array of objects to CSV format and triggers a browser download.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and remove them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and container settings with custom plugins.",
  "project_state.json": "JSON snapshot of project requirements, architectural notes, known issues, and existing feature definitions for build planning."
}