{
  "backend/main.mo": "Main Motoko actor defining admin login, access control, storage mixins, and data types for clients, transporters, loads, tracking, and documents.",
  "backend/migration.mo": "Migration module converting old actor state to the new schema, updating contracts, loads, clients, transporters, and associated types.",
  "feature_evidence.json": "Feature mapping document listing feature IDs, affected files, components, test IDs, and metadata for frontend and backend changes.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend files describing their roles and recent updates.",
  "frontend/.gitignore": "Standard .gitignore configuration excluding dependencies, build outputs, environment files, IDE files, and Capacitor artifacts.",
  "frontend/ADMIN_ACCESS.md": "Documentation explaining the password‑based admin system, token flow, route protection, and backend integration details.",
  "frontend/ANDROID_BUILD.md": "Guide for building Android APK/AAB files, covering prerequisites, environment setup, signing, versioning, and Play Store preparation.",
  "frontend/capacitor.config.ts": "Capacitor configuration defining app metadata, build directory, HTTPS Android scheme, and keystore-based signing options.",
  "frontend/index.css": "Tailwind setup defining theme variables for light and dark modes and applying base styles.",
  "frontend/index.html": "Basic HTML entry file loading the React app via main.tsx.",
  "frontend/scripts/android/_signing-env.example": "Template for configuring Android signing environment variables for release builds.",
  "frontend/scripts/android/build-debug-apk.sh": "Script that builds and outputs a debug APK after checking prerequisites and syncing Capacitor.",
  "frontend/scripts/android/build-release-aab.sh": "Script that builds a signed Android App Bundle for Play Store using provided keystore credentials.",
  "frontend/scripts/android/build-release-apk.sh": "Script that builds a signed release APK for distribution using Android signing variables.",
  "frontend/src/App.tsx": "Main app component configuring React Query, theming, routing, and global notifications.",
  "frontend/src/components/admin/AdminAssignTransporterControl.tsx": "Admin UI control to assign or unassign verified transporters to a load using select input.",
  "frontend/src/components/admin/AdminClientDetailsDialog.tsx": "Dialog for viewing, editing, deleting, and updating verification status of a client.",
  "frontend/src/components/admin/AdminContactMessageDetailsDialog.tsx": "Dialog for viewing and deleting individual contact messages submitted by users.",
  "frontend/src/components/admin/AdminLoadDetailsDialog.tsx": "Admin dialog for viewing and editing load details, including updating, deleting, assigning client/transporter, and approving or rejecting loads.",
  "frontend/src/components/admin/AdminTransporterDetailsDialog.tsx": "Admin dialog for editing transporter details, deleting a transporter, and updating verification status.",
  "frontend/src/components/admin/AdminYearsManagementSection.tsx": "Admin interface for adding and removing available years, with validation and confirmation dialogs.",
  "frontend/src/components/admin/LocationEvidenceViewer.tsx": "Displays a transporter's submitted location evidence with timestamps, map data, and screenshot viewing.",
  "frontend/src/components/admin/TransporterLocationList.tsx": "Shows a list of transporters with contact info, truck type, status, and live location freshness indicators.",
  "frontend/src/components/admin/TransporterLocationsFilters.tsx": "Filter controls for transporter list, allowing hiding those without locations and filtering by truck type.",
  "frontend/src/components/admin/TransporterLocationsMapView.tsx": "Displays transporter locations in a simple map-like grid with selectable details and handles missing or errored map data.",
  "frontend/src/components/admin/TransporterLocationsTab.tsx": "Fetches transporter data, applies filters, and renders map or list views with error and loading handling.",
  "frontend/src/components/ads/AdSnippetPreviewFrame.tsx": "Renders an iframe preview of an ad snippet with load/error diagnostics and empty-state handling.",
  "frontend/src/components/ads/BottomAd.tsx": "Shows a dismissible bottom advertisement using loaded ad settings and embeds the snippet preview.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access-denied message with support contact and navigation options.",
  "frontend/src/components/auth/AdminContactMessageDetailsDialog.tsx": "Modal dialog showing submitted contact message details with a placeholder delete action.",
  "frontend/src/components/auth/AdminRouteErrorBoundary.tsx": "Error boundary for admin routes that resets queries and shows a recovery UI on failure.",
  "frontend/src/components/auth/AdminRouteErrorState.tsx": "UI for admin access errors offering retry or sign‑out actions and clearing cached state.",
  "frontend/src/components/auth/AdminSignInPrompt.tsx": "Prompts users to sign in with admin credentials to access restricted areas.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that handles Internet Identity auth, shows loading states, and triggers optional post-login callback.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for new users to enter name and email and submit profile creation via a mutation.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Wrapper that checks admin status, handles redirects, shows loading or error states, and renders children only for admins.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with company info, quick links, coverage areas, and a Caffeine.ai attribution link.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main layout including top navigation, routed content outlet, bottom ad, and footer.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar with links, mobile menu, branding, and login button with post-login navigation.",
  "frontend/src/components/loads/LoadInterestEvidenceDialog.tsx": "Dialog for capturing geolocation and uploading an image as load interest evidence with validation and progress tracking.",
  "frontend/src/components/loads/LoadLocations.tsx": "Displays pickup and drop-off locations with icons if available.",
  "frontend/src/components/transporter/LiveLocationToggleCard.tsx": "Card allowing transporters to start or stop live location sharing, showing status, errors, and last update time.",
  "frontend/src/components/transporter/TransporterStatusCard.tsx": "React card component that displays and updates a transporter’s operational status using queries and mutation hooks.",
  "frontend/src/config/adminBootstrap.ts": "Reads and normalizes a bootstrap admin principal from environment variables and compares it to the current principal.",
  "frontend/src/config/ads.ts": "Defines AdMob config and manages loading and saving bottom ad settings from localStorage.",
  "frontend/src/config/download.ts": "Provides a helper to read a fallback Android APK download URL from environment variables.",
  "frontend/src/constants/adminToken.ts": "Exports constants for admin token storage and change event names.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity and reinitializes dependent queries when it changes.",
  "frontend/src/hooks/useAdminAccess.ts": "Provides mutations to grant or bootstrap admin access by assigning admin roles and invalidating related queries.",
  "frontend/src/hooks/useAdminToken.ts": "Tracks the admin token from sessionStorage and updates reactively via a custom event listener.",
  "frontend/src/hooks/useAdminVerification.ts": "Exports helpers to verify admin access using an admin token and update query cache, plus a hook wrapper.",
  "frontend/src/hooks/useAuth.ts": "Aggregates identity, profile, role, and admin state into a unified auth object with loading and error logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements React context and provider for Internet Identity authentication with login, clear, and status handling.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for backend operations such as contact messages, admin checks, client info, and more.",
  "frontend/src/hooks/useTransporterLiveLocation.ts": "Hook that manages periodic geolocation tracking, error handling, and sending live location updates to the backend.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for querying and mutating the logged-in user's profile and role using React Query and an actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode styles, and global utility classes.",
  "frontend/src/main.tsx": "Entry point that initializes React, React Query, Internet Identity provider, and renders the app.",
  "frontend/src/pages/AboutPage.tsx": "Static about page describing the company, mission, values, and regional coverage.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page that loads clients, transporters, loads, messages, and manages detail dialogs and admin actions.",
  "frontend/src/pages/AdminPasswordLoginPage.tsx": "Admin login page handling credential input, token storage, admin verification, and diagnostic logging.",
  "frontend/src/pages/ClientRegistrationPage.tsx": "Client registration form that loads existing data, submits client info with contract details, and shows verification status.",
  "frontend/src/pages/ContactPage.tsx": "Contact form allowing users to submit inquiries, plus static company contact info.",
  "frontend/src/pages/ContractsPage.tsx": "Page for verified users to post contracts and browse/filter existing contracts by year.",
  "frontend/src/pages/DownloadPage.tsx": "Displays Android APK download link with fallback handling and installation guidance.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, company overview, calls to action, and testimonials.",
  "frontend/src/pages/LoadBoardPage.tsx": "Load board for transporters and clients to post, view, and manage freight loads with verification checks.",
  "frontend/src/pages/ServicesPage.tsx": "Renders a services overview page with cards describing logistics offerings and a 'How It Works' section.",
  "frontend/src/pages/TransporterRegistrationPage.tsx": "Implements a transporter registration form with authentication checks, document handling, and submission logic.",
  "frontend/src/routeTree.tsx": "Defines the application's route structure using TanStack Router and configures a hash-based router.",
  "frontend/src/utils/csv.ts": "Provides a utility to convert objects to CSV format and trigger a file download in the browser.",
  "frontend/src/utils/urlParams.ts": "Offers helpers for reading, storing, and clearing URL parameters with session persistence.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, plugins, and design tokens including colors, fonts, and animations.",
  "project_state.json": "Contains project metadata, high-level summary, architectural notes, known issues, and lists of existing and new feature requests for an admin logistics system. Captures schema versioning and context needed for continued feature development."
}