{
  "backend/main.mo": "Motoko canister defining admin credential login, access control mixins, and data models for clients, transporters, loads, tracking, and storage.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs for admin-token and routing behavior fixes.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing routing, auth, admin flow, UI components, and pages.",
  "frontend/.gitignore": "Ignore rules for dependencies, build outputs, environment files, IDE files, and Android/iOS build artifacts.",
  "frontend/ADMIN_ACCESS.md": "Documentation explaining password-based admin login, session token flow, and backend verification requirements.",
  "frontend/ANDROID_BUILD.md": "Guide for building Android APK/AAB files and preparing them for Play Store publishing.",
  "frontend/capacitor.config.ts": "Capacitor configuration defining app metadata, web directory, Android HTTPS scheme, and keystore build options.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark UI colors and global styling.",
  "frontend/index.html": "Minimal HTML entrypoint that loads the React app via main.tsx.",
  "frontend/scripts/android/_signing-env.example": "Template for Android signing environment variables used for release builds.",
  "frontend/scripts/android/build-debug-apk.sh": "Shell script to build a debug Android APK, including prerequisite checks, web build, sync, and Gradle build steps.",
  "frontend/scripts/android/build-release-aab.sh": "Builds and signs an Android App Bundle for Play Store, verifying env vars, building the web app, syncing Capacitor, and running Gradle bundleRelease.",
  "frontend/scripts/android/build-release-apk.sh": "Builds and signs a release APK for distribution, checking signing vars, building the web app, syncing Capacitor, and running Gradle assembleRelease.",
  "frontend/src/App.tsx": "Sets up the React app with React Query, theme provider, router, and toast notifications.",
  "frontend/src/components/admin/LocationEvidenceViewer.tsx": "Displays transporter-submitted location evidence with timestamps, location info, and screenshot viewing.",
  "frontend/src/components/admin/TransporterLocationList.tsx": "Lists transporters with their details, status, and recent or stale location information.",
  "frontend/src/components/admin/TransporterLocationsFilters.tsx": "Provides filters for hiding transporters without location and selecting by truck type.",
  "frontend/src/components/admin/TransporterLocationsMapView.tsx": "Shows a simple map-style grid of transporters with location data and selectable detail view.",
  "frontend/src/components/admin/TransporterLocationsTab.tsx": "Displays transporter locations with filters, map view fallback, and a list view, fetching transporters, truck types, and statuses.",
  "frontend/src/components/ads/AdSnippetPreviewFrame.tsx": "Renders an iframe preview of an ad snippet with diagnostics for empty or failed loads.",
  "frontend/src/components/ads/BottomAd.tsx": "Shows a dismissible bottom advertisement using stored settings and an iframe preview component.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access‑denied message with options to return home or go to admin login.",
  "frontend/src/components/auth/AdminRouteErrorBoundary.tsx": "Error boundary for admin routes that resets state and invalidates queries on retry.",
  "frontend/src/components/auth/AdminRouteErrorState.tsx": "UI for admin access errors offering retry, sign‑out, and guidance for resolving issues.",
  "frontend/src/components/auth/AdminSignInPrompt.tsx": "Prompts users to sign in with admin credentials and links to admin login.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth, loading states, and automatic retries.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for new users to enter name and email and submit a profile creation request.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Guards admin routes by checking auth state, handling redirects, loading, and error states.",
  "frontend/src/components/layout/Footer.tsx": "Renders site footer with links, coverage info, and attribution.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper with top navigation, main content area, ads, and footer.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar with route links, mobile menu, and login button.",
  "frontend/src/components/loads/LoadInterestEvidenceDialog.tsx": "Dialog to capture location and upload image evidence for load interest, with validation and progress.",
  "frontend/src/components/loads/LoadLocations.tsx": "Displays pickup and drop‑off locations with icons if provided.",
  "frontend/src/components/transporter/LiveLocationToggleCard.tsx": "Card to start or stop live location sharing and show status, errors, and last update.",
  "frontend/src/components/transporter/TransporterStatusCard.tsx": "Card for viewing and updating transporter operational status with validation and timestamps.",
  "frontend/src/config/adminBootstrap.ts": "Reads and validates optional bootstrap admin principal from environment variables.",
  "frontend/src/config/ads.ts": "Defines AdMob config and HTML snippet plus utilities to load and save ad settings in localStorage.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAdminAccess.ts": "Provides mutations to grant or bootstrap admin access and invalidates related role queries.",
  "frontend/src/hooks/useAdminToken.ts": "Tracks the admin token from sessionStorage and updates reactively via a custom event listener.",
  "frontend/src/hooks/useAuth.ts": "Combines identity, admin token, role, profile, and admin checks into a unified authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, loading stored identities and providing login/logout utilities via context.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for backend operations including admin checks, clients, transporters, loads, and messages.",
  "frontend/src/hooks/useTransporterLiveLocation.ts": "Provides live location tracking for transporters, periodically sending geolocation updates with error handling.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and saves the caller’s user profile and role with React Query, gated by authentication state.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme CSS variables and base typography/utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page describing the company, mission, values, and regional coverage using cards and icons.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Implements a multi-tab admin dashboard for managing loads, clients, transporters, messages, settings, and APK links.",
  "frontend/src/pages/AdminPasswordLoginPage.tsx": "Provides an admin login form that authenticates via backend and stores an admin token.",
  "frontend/src/pages/ClientRegistrationPage.tsx": "Handles client registration and profile updates with verification status indicators.",
  "frontend/src/pages/ContactPage.tsx": "Displays a contact form that submits messages and shows company contact details.",
  "frontend/src/pages/HomePage.tsx": "Renders the landing page with hero, about, and promotional sections plus registration links and testimonials.",
  "frontend/src/pages/LoadBoardPage.tsx": "Implements the load board where clients post loads and transporters view approved loads, including form handling and file uploads.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a list of logistics services and an overview of the platform workflow.",
  "frontend/src/pages/TransporterRegistrationPage.tsx": "Handles transporter registration with form fields, document uploads, and verification status display.",
  "frontend/src/routeTree.tsx": "Defines the application's route structure and layout using TanStack Router.",
  "frontend/src/utils/csv.ts": "Provides a utility function to convert objects to CSV format and trigger a file download.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash parameters, persisting them in sessionStorage, and emitting a token-change event when the admin token updates.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, fonts, animations, and container settings, with typography, container‑queries, and animate plugins.",
  "project_state.json": "Tracks project state, known issues, and feature requirements related to fixing admin token handling, routing, and dashboard access."
}