{
  "backend/main.mo": "Primary backend canister defining admin login, access control, trucking domain types, and storage-backed data maps for clients, transporters, and loads.",
  "feature_evidence.json": "Feature evidence report listing modified UI files and components for restoring the Admin entry point in navigation.",
  "frontend-file-summaries.txt": "Reference file containing prewritten summaries of various frontend components and pages.",
  "frontend/.gitignore": "Ignore rules for Node, build artifacts, environment files, IDE folders, and Capacitor platforms.",
  "frontend/ADMIN_ACCESS.md": "Documentation describing the password‑based admin login flow, session token handling, and route protection logic.",
  "frontend/ANDROID_BUILD.md": "Guide for building Android APK/AAB files and preparing them for Play Store publishing.",
  "frontend/capacitor.config.ts": "Capacitor configuration specifying app metadata, web directory, HTTPS scheme, and Android keystore build options.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and global base styles.",
  "frontend/index.html": "HTML entry file defining the root element and loading the main React script.",
  "frontend/scripts/android/_signing-env.example": "Template environment file for Android keystore signing variables.",
  "frontend/scripts/android/build-debug-apk.sh": "Shell script that builds a debug Android APK by checking prerequisites, building the web app, syncing Capacitor, and invoking Gradle.",
  "frontend/scripts/android/build-release-aab.sh": "Builds a signed Android App Bundle, verifying signing creds and prerequisites, building the web app, syncing Capacitor, and running Gradle bundleRelease.",
  "frontend/scripts/android/build-release-apk.sh": "Builds a signed release APK for external distribution, checking signing creds and prerequisites, building the web app, syncing Capacitor, and running Gradle assembleRelease.",
  "frontend/src/App.tsx": "Root app component configuring React Query, theme provider, routing, and global toaster notifications.",
  "frontend/src/components/admin/LocationEvidenceViewer.tsx": "Displays submitted location evidence for a transporter with timestamps, coordinates, and screenshot viewing.",
  "frontend/src/components/admin/TransporterLocationList.tsx": "Lists transporters with details, live location info, and status freshness indicators.",
  "frontend/src/components/admin/TransporterLocationsFilters.tsx": "Filter controls for hiding transporters without location and selecting truck type.",
  "frontend/src/components/admin/TransporterLocationsMapView.tsx": "Shows a simple grid-based map view of transporters with location data and expandable detail sections.",
  "frontend/src/components/admin/TransporterLocationsTab.tsx": "Admin view that loads transporters with locations, applies filters, shows a map or fallback, and lists filtered transporters with status lookup.",
  "frontend/src/components/ads/AdSnippetPreviewFrame.tsx": "Renders an iframe preview of an ad snippet with load/error diagnostics and a placeholder when empty.",
  "frontend/src/components/ads/BottomAd.tsx": "Displays a dismissible bottom advertisement using configured snippet settings and session-based dismissal tracking.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access denied message with support contact and navigation options to home or admin login.",
  "frontend/src/components/auth/AdminRouteErrorBoundary.tsx": "Error boundary for admin routes that resets query state and displays a retry screen on errors.",
  "frontend/src/components/auth/AdminRouteErrorState.tsx": "UI for admin verification failures with retry and sign‑out actions that clear tokens and cache.",
  "frontend/src/components/auth/AdminSignInPrompt.tsx": "Prompts users to sign in with admin credentials and provides support contact info.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout with loading states, error handling, and optional callback.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for creating a basic user profile with name and email, using a save mutation and validation.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Gatekeeper component that verifies admin status, handles redirects, and shows loading or error states before rendering children.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with company info, navigation links, coverage areas, and a caffeine.ai credit link.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main page layout including top navigation, routed content, bottom ad, and footer.",
  "frontend/src/components/layout/TopNav.tsx": "Implements the top navigation bar with links, login handling, and a responsive mobile menu.",
  "frontend/src/components/loads/LoadInterestEvidenceDialog.tsx": "Provides a dialog for uploading load interest evidence, capturing user location, and submitting both.",
  "frontend/src/components/loads/LoadLocations.tsx": "Displays pickup and drop-off locations with icons if provided.",
  "frontend/src/components/transporter/LiveLocationToggleCard.tsx": "Card UI allowing transporters to start or stop sharing live location and view status updates.",
  "frontend/src/components/transporter/TransporterStatusCard.tsx": "Lets transporters view and update their operational status with validation and mutation handling.",
  "frontend/src/config/adminBootstrap.ts": "Handles retrieval and comparison of a build-time admin bootstrap principal from environment variables.",
  "frontend/src/config/ads.ts": "Contains ad configuration, default ad snippet, and functions to load or save bottom ad settings.",
  "frontend/src/config/download.ts": "Provides a fallback APK download URL loaded from environment variables.",
  "frontend/src/constants/adminToken.ts": "Defines shared constants for admin token storage and change event names.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAccess.ts": "Provides mutations to grant or bootstrap admin access, invalidating related admin role queries after success.",
  "frontend/src/hooks/useAdminToken.ts": "Tracks the admin token from sessionStorage and updates reactively when it changes via custom events.",
  "frontend/src/hooks/useAdminVerification.ts": "Verifies admin access by initializing the actor with the admin token and exposes a hook-powered verification helper.",
  "frontend/src/hooks/useAuth.ts": "Aggregates identity, profile, role, and admin-token state to compute overall authentication and admin status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state, login/logout functions, and status handling via context.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple data queries and mutations using the backend actor for admin checks, clients, contact info, and other domain entities.",
  "frontend/src/hooks/useTransporterLiveLocation.ts": "Handles periodic transporter geolocation updates, including permission errors and mutation calls to persist the location.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and updates the caller’s user profile and role, only enabling queries when authenticated.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes plus base typography and utility styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider and renders the root component.",
  "frontend/src/pages/AboutPage.tsx": "Renders a detailed About page with company story, mission, values, and regional coverage using card components.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Implements a complex admin dashboard with data fetching, approvals, verification actions, APK link settings, and tabbed management views.",
  "frontend/src/pages/AdminPasswordLoginPage.tsx": "Provides an admin password login form with diagnostic tracking, token handling, and backend verification flow.",
  "frontend/src/pages/ClientRegistrationPage.tsx": "Displays a client registration form with validation, contract entry, and submission via backend mutation.",
  "frontend/src/pages/ContactPage.tsx": "Offers a contact form for users to send messages and shows company contact details.",
  "frontend/src/pages/ContractsPage.tsx": "UI for viewing and posting contracts, including form validation, date handling, verification checks, and listing existing contracts.",
  "frontend/src/pages/DownloadPage.tsx": "Displays Android APK download link using backend or fallback URL with loading and error states.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, company info, testimonials, and registration CTAs.",
  "frontend/src/pages/LoadBoardPage.tsx": "Load board for clients and transporters with load posting, file uploads, load browsing, and verification checks.",
  "frontend/src/pages/ServicesPage.tsx": "Static presentation of company services and workflow steps.",
  "frontend/src/pages/TransporterRegistrationPage.tsx": "Transporter registration form with document uploads, truck type selection, and prefill of existing details.",
  "frontend/src/routeTree.tsx": "Defines the React Router route tree with hash-based history and all app page routes.",
  "frontend/src/utils/csv.ts": "Provides a function to convert objects to CSV and trigger a file download in the browser.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Describes the current project state, features, issues, and pending requests."
}