{
  "backend/main.mo": "Main actor implementing storage, authorization, client/transporter registration, loads, tracking, contact messages, user profiles, and admin-set APK link.",
  "backend/migration.mo": "Defines migration logic upgrading client and transporter records by adding default contract details.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing their purpose and behavior.",
  "frontend/.gitignore": "Ignore rules for dependencies, build output, environment files, IDE files, and Capacitor platforms.",
  "frontend/ADMIN_ACCESS.md": "Documentation describing the admin route access control flow and related components.",
  "frontend/ANDROID_BUILD.md": "Guide for building, signing, and publishing Android APK/AAB files for the app.",
  "frontend/capacitor.config.ts": "Capacitor configuration specifying app metadata, web output directory, and Android keystore settings.",
  "frontend/index.css": "Tailwind CSS base styles and theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML file mounting the app and loading main.tsx.",
  "frontend/scripts/android/_signing-env.example": "Example environment file defining Android keystore signing variables.",
  "frontend/scripts/android/build-debug-apk.sh": "Script that builds a debug APK after checking prerequisites and syncing Capacitor.",
  "frontend/scripts/android/build-release-aab.sh": "Script that builds a signed Android App Bundle for Play Store using provided keystore variables.",
  "frontend/scripts/android/build-release-apk.sh": "Script that builds a signed release APK for distribution outside the Play Store.",
  "frontend/src/App.tsx": "Main React app setup configuring React Query, routing, theming, and global toaster.",
  "frontend/src/components/ads/AdSnippetPreviewFrame.tsx": "Component rendering ad snippet in an iframe with load/error diagnostics.",
  "frontend/src/components/ads/BottomAd.tsx": "Bottom banner ad component that loads settings, supports dismissal, and shows ad preview.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Screen informing users they lack admin permissions with link back to home.",
  "frontend/src/components/auth/AdminSignInPrompt.tsx": "Prompt requiring admin login, storing redirect path and showing login button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth state and loading states.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for creating a user profile with name and email, using saveProfile hook.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Gatekeeper component that checks auth and admin status, showing loading, sign‑in prompt, or access denied before rendering children.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with links, regional coverage info, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main page layout with top navigation, content area, bottom ad, and footer.",
  "frontend/src/components/layout/TopNav.tsx": "Implements responsive top navigation with links, mobile menu, logo, and login button.",
  "frontend/src/components/loads/LoadLocations.tsx": "Displays pickup and drop-off locations with icons when provided.",
  "frontend/src/config/ads.ts": "Provides ad configuration, default HTML snippet, and helpers to load/save ad settings in localStorage.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAuth.ts": "Combines identity and profile/role queries to expose auth state, loading flags, and admin status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling identity loading, login, logout, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for contact messages, clients, transporters, loads, and APK link operations using the actor.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for fetching and saving the caller's user profile and role with actor-dependent loading states.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes with earth-tone colors.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the company About page with mission, values, and regional coverage details using cards and icons.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Implements the admin dashboard with tabs for loads, clients, transporters, contacts, ads, and APK link management.",
  "frontend/src/pages/ClientRegistrationPage.tsx": "Provides a client registration and profile update form tied to authentication and backend mutation hooks.",
  "frontend/src/pages/ContactPage.tsx": "Displays a contact form that saves messages and a section with company contact details.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with a hero section, company overview, action buttons, and testimonials.",
  "frontend/src/pages/LoadBoardPage.tsx": "Page for browsing, posting, and viewing a user's loads with form handling, file uploads, and load creation logic.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a list of logistics services and a how‑it‑works section using static content.",
  "frontend/src/pages/TransporterRegistrationPage.tsx": "Transporter registration form handling profile data, required document uploads, and saving transporter details.",
  "frontend/src/routeTree.tsx": "Defines the application's route structure using TanStack Router and maps paths to page components.",
  "frontend/src/utils/csv.ts": "Utility to convert arrays of objects to CSV and trigger a browser download.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters and session values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Defines project state, architectural notes, and requirements including naming decisions, admin gating, document uploads, payment terms, tracking phases, security practices, and existing feature metadata."
}