{
  "kind": "build_request",
  "title": "Fix /admin route so the admin access gate and login prompt always render",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-44",
      "text": "Fix the Admin page rendering so navigating to the admin route reliably shows the admin access gate UI (loading, sign-in prompt, or access denied) instead of a blank/non-rendering screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "it doesn't show the admin page even the login access to enter details fix this"
        ]
      },
      "acceptanceCriteria": [
        "When visiting \"/#/admin\" while signed out, the page renders the AdminSignInPrompt UI (not a blank page).",
        "When visiting \"/#/admin\" while signed in but not an admin, the page renders the AccessDeniedScreen UI (not a blank page).",
        "When visiting \"/#/admin\" while signed in as an admin, the Admin Dashboard UI renders.",
        "The admin route continues to exist at path \"/admin\" in TanStack Router (hash history), and the app remains hash-routed (no switch away from createHashHistory).",
        "Any runtime error occurring in the admin page route (including during auth/role checks or initial admin dashboard render) is caught and replaced with a visible error state that includes a clear English message and a retry action (so users never see a completely blank admin page)."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Ensure the primary navigation path to Admin works consistently in production by verifying that the header Admin link and any other Admin entry points navigate correctly in hash-based routing and do not depend on server-side rewrites.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "it doesn't show the admin page even the login access to enter details fix this"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the \"Admin\" link in the top navigation always navigates to the admin route and displays the admin gate UI.",
        "The Footer \"Admin\" quick link continues to point to the hash route format \"/#/admin\" and successfully loads the admin gate UI.",
        "Directly entering the URL with hash format \"/#/admin\" loads the admin gate UI without requiring any additional navigation steps."
      ]
    },
    {
      "id": "REQ-46",
      "text": "Improve the admin gate troubleshooting experience when auth or role/profile queries fail (e.g., backend unreachable) by displaying a clear English error message and a retry option on the /admin gate instead of staying indefinitely on \"Verifying access...\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "it doesn't show the admin page even the login access to enter details fix this"
        ]
      },
      "acceptanceCriteria": [
        "If role/profile verification cannot complete due to an error, /admin shows a non-blocking error state (English text) with a retry action.",
        "The loading state on /admin does not persist forever without any user feedback; the UI provides an actionable next step (retry and/or sign out/sign in again).",
        "Existing three-state behavior (loading, unauthenticated prompt, authenticated non-admin denied) remains intact for normal successful cases."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useInternetIdentity.tsx (immutable paths).",
    "Keep the backend as a single Motoko actor (no additional backend services).",
    "Do not add email/password authentication; admin access must remain Internet Identity + authorized admin role."
  ],
  "nonGoals": [
    "Granting admin access based on email address (e.g., moleleholdings101@gmail.com).",
    "Adding a fixed admin username/password.",
    "Changing routing style away from TanStack Router hash history."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}