{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize password-admin login/session so /admin reliably renders after login and refresh",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix password-admin session persistence and routing so /admin renders dashboard after login and remains authorized across refresh until sessionStorage is cleared.",
      "acceptanceCriteria": [
        "From a fresh session (no Internet Identity login), entering correct admin credentials on `/admin/login` redirects to `/admin` and the dashboard renders.",
        "After refreshing the page while on `/admin`, the user remains authorized for the duration of the browser session (until sessionStorage is cleared) and the dashboard still renders.",
        "If the admin token is cleared (logout/sign-out flow), attempting to access `/admin` redirects to `/admin/login`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the admin verification hook (useIsCallerAdmin) so that when sessionStorage.caffeineAdminToken is present, the current actor is explicitly initialized with the token before running admin verification; this ensures correct authorization after refresh even with an anonymous identity. (Uses the existing authorization/access-control initialization behavior; verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/auth/RequireAdmin.tsx",
          "operation": "modify",
          "description": "Adjust admin route guarding so it only redirects to /admin/login after a definitive verification outcome (authorized vs unauthorized) and does not prematurely redirect while verification is still pending, preventing access-denied/redirect flicker and improving post-refresh stability."
        },
        {
          "path": "frontend/src/pages/AdminPasswordLoginPage.tsx",
          "operation": "modify",
          "description": "After successful adminLogin, store the token and then drive navigation to /admin only after the admin verification has been refetched and confirmed authorized (no arbitrary delays), ensuring the dashboard renders immediately after login."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure password-admin sessions initialize backend access control with the admin token even when using an anonymous identity, so admin verification succeeds immediately after login.",
      "acceptanceCriteria": [
        "When `sessionStorage.caffeineAdminToken` is present, admin verification uses an actor instance that has had `_initializeAccessControlWithSecret(caffeineAdminToken)` invoked, regardless of whether Internet Identity is logged in.",
        "Immediately after successful admin password login, the admin verification query refetches and resolves to authorized without requiring manual refresh.",
        "No changes are made to any frontend immutable paths listed in SYSTEM_CONTEXT (in particular, do not edit `frontend/src/hooks/useActor.ts`)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement token-based access-control initialization inside the admin verification flow: when adminToken exists, call actor._initializeAccessControlWithSecret(adminToken) as part of the verification query path so isCallerAdmin() reflects the password-admin session even for anonymous identity. (Leverages the selected authorization component’s access-control initialization; verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/AdminPasswordLoginPage.tsx",
          "operation": "modify",
          "description": "On successful password login, trigger a deterministic admin verification refetch using React Query (await refetch completion) and proceed based on the verified result; ensure this works even when the actor was created as anonymous."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Remove timing/race dependencies in admin login and admin route guarding by using explicit state transitions and a retryable error state.",
      "acceptanceCriteria": [
        "Admin login does not rely on arbitrary delays to succeed; it waits on concrete verification/refetch completion before considering the session valid.",
        "If admin verification fails after login, the UI shows a clear error state (in English) with a working Retry action that re-attempts verification.",
        "The `/admin` route never gets stuck in an infinite redirect loop between `/admin` and `/admin/login`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPasswordLoginPage.tsx",
          "operation": "modify",
          "description": "Remove setTimeout-based waiting and replace with explicit flow: token stored → verification refetch awaited → navigate to /admin if authorized; if verification fails, show an English error message with a Retry action that re-attempts verification refetch."
        },
        {
          "path": "frontend/src/components/auth/RequireAdmin.tsx",
          "operation": "modify",
          "description": "Ensure the guard cannot enter an infinite redirect loop by only redirecting when verification has completed and is unauthorized; keep loading states while verification is in-flight and show the existing error UI with Retry when verification errors."
        },
        {
          "path": "frontend/src/components/auth/AdminRouteErrorState.tsx",
          "operation": "modify",
          "description": "Ensure the Retry action reliably re-attempts admin verification (including re-initializing access control via the admin token path) by refetching the admin verification query in a targeted way, without requiring page refresh."
        }
      ]
    }
  ]
}