{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "TruckTrack Admin: Admin nav link, password admin login flow, and correct dashboard record actions",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an Admin entry to desktop and mobile navigation that routes to /admin/login.",
      "acceptanceCriteria": [
        "Top navigation shows an \"Admin\" entry on desktop navigation.",
        "Mobile menu shows an \"Admin\" entry when expanded.",
        "Clicking \"Admin\" navigates to \"/admin/login\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/TopNav.tsx",
          "operation": "modify",
          "description": "Add an \"Admin\" navigation item to both the desktop nav and the mobile expanded menu, routing to \"/admin/login\". Ensure mobile click also closes the mobile menu."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure /admin/login performs backend admin login, stores token in sessionStorage via existing mechanism, verifies admin, and navigates to /admin; show errors on invalid credentials.",
      "acceptanceCriteria": [
        "Submitting username \"Gushna\" and password \"Gushgesh#9\" results in a successful login token being stored in session storage (using the app's existing admin-token mechanism).",
        "After login, admin verification succeeds and the user is navigated to \"/admin\".",
        "Submitting invalid credentials shows an error message and does not navigate to \"/admin\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPasswordLoginPage.tsx",
          "operation": "modify",
          "description": "Align the login submit flow with the app's existing password-admin token mechanism: call backend admin login, store the returned token in sessionStorage using the existing helper, then trigger admin verification and navigate to \"/admin\" on success; ensure invalid credentials reliably surface an error and do not navigate."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure admin verification query behavior remains consistent with the selected \"authorization\" component's frontend guidance (e.g., handle authorization failures gracefully and keep verification dependent on the stored admin token). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Fix admin dashboard actions so approve/reject and verify/reject operate on the correct underlying load IDs and user principals, and refresh UI after mutations.",
      "acceptanceCriteria": [
        "Approving/rejecting a specific pending load updates that specific load in the backend and the UI refreshes to reflect the change.",
        "Verifying/rejecting a specific client updates that specific client's verification status in the backend and the UI refreshes to reflect the change.",
        "Verifying/rejecting a specific transporter updates that specific transporter's verification status in the backend and the UI refreshes to reflect the change.",
        "No admin dashboard action uses an index-derived ID (e.g., \"L1\", \"L2\") or a non-principal identifier (e.g., email) when calling backend admin mutation methods that require true IDs/principals."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Update dashboard section list rendering and button click handlers to use true identifiers from identifier-inclusive query results (loadId for loads; Principal for clients/transporters) rather than placeholder/index-derived IDs or emails. Ensure list keys and action arguments are driven by the true IDs/principals and that post-mutation UI refresh occurs via existing React Query invalidations."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust/extend admin dashboard query hooks to return identifier-inclusive data used by action handlers, and ensure relevant queries are invalidated/refetched after approve/verify mutations so the dashboard updates without a full refresh."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Consume identifier-inclusive admin query results in React Query hooks and dashboard UI to support correct admin actions and refetch after mutations.",
      "acceptanceCriteria": [
        "Backend provides a query for pending loads that includes each load's loadId alongside the Load data.",
        "Backend provides a query for approved loads that includes each load's loadId alongside the Load data.",
        "Backend provides an admin query for clients that includes each client's Principal alongside the ClientInfo data (so the frontend can call verifyClient with a real Principal).",
        "Backend provides an admin query for transporters that includes each transporter's Principal alongside the TransporterDetails data (so the frontend can call verifyTransporter with a real Principal).",
        "Frontend admin dashboard uses these identifier-inclusive query results to drive button click handlers (approve/reject/verify) with correct arguments.",
        "All impacted queries are invalidated/refetched after mutations so the dashboard reflects changes without requiring a full page refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add/adjust React Query hooks for admin-only lists to consume identifier-inclusive backend capabilities (e.g., pending loads with loadId, clients with Principal, transporters with Principal, and approved loads with loadId when available). Where the type surface is not yet present, use a safe runtime access pattern that avoids TypeScript breakage while still enabling the dashboard to migrate to the new identifier-inclusive results."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Switch admin dashboard tabs/sections to use the new identifier-inclusive hooks and wire their results into approve/reject/verify handlers. Ensure all impacted queries are invalidated/refetched after mutations so state updates are reflected immediately."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Keep /admin access-controlled: redirect unauthenticated users to /admin/login; allow verified admins; support sign-out clearing admin session.",
      "acceptanceCriteria": [
        "Navigating directly to \"/admin\" without a valid admin session redirects to \"/admin/login\" (or otherwise prevents dashboard content from rendering).",
        "After successful admin login and verification, navigating to \"/admin\" renders the dashboard content without access errors.",
        "Signing out from the dashboard clears the admin session and returns the user to \"/admin/login\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/RequireAdmin.tsx",
          "operation": "modify",
          "description": "Update admin route guarding so that navigating to \"/admin\" without a valid password-admin session (no stored admin token) redirects to \"/admin/login\" (not just rendering nothing). Keep verified-admin rendering behavior intact and continue handling verification errors gracefully. Verify the selected \"authorization\" component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Confirm the dashboard sign-out action clears the stored admin session token via the existing admin-token mechanism and navigates back to \"/admin/login\"; ensure this remains functional after any dashboard refactors."
        }
      ]
    }
  ]
}