{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore reliable /admin gate rendering and add visible error + retry states for hash-routed admin access",
  "requirements": [
    {
      "id": "REQ-44",
      "summary": "Make /admin always render a visible admin gate state (loading, sign-in prompt, denied) and never go blank by adding route-safe error handling around admin auth checks and dashboard rendering.",
      "acceptanceCriteria": [
        "When visiting \"/#/admin\" while signed out, the page renders the AdminSignInPrompt UI (not a blank page).",
        "When visiting \"/#/admin\" while signed in but not an admin, the page renders the AccessDeniedScreen UI (not a blank page).",
        "When visiting \"/#/admin\" while signed in as an admin, the Admin Dashboard UI renders.",
        "The admin route continues to exist at path \"/admin\" in TanStack Router (hash history), and the app remains hash-routed (no switch away from createHashHistory).",
        "Any runtime error occurring in the admin page route (including during auth/role checks or initial admin dashboard render) is caught and replaced with a visible error state that includes a clear English message and a retry action (so users never see a completely blank admin page)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Refactor the /admin page to always render the existing RequireAdmin gate, and wrap the admin dashboard content in a route-safe error boundary so any runtime error is replaced with a visible Admin error state and retry action."
        },
        {
          "path": "frontend/src/components/auth/AdminRouteErrorState.tsx",
          "operation": "create",
          "description": "Add a dedicated, user-visible error state component for the /admin route with clear English messaging and a retry action (and optional sign-out/sign-in guidance) to prevent blank screens when the admin route throws."
        },
        {
          "path": "frontend/src/components/auth/AdminRouteErrorBoundary.tsx",
          "operation": "create",
          "description": "Add a small error boundary wrapper used by the /admin page to catch render-time errors from the gate and/or dashboard and display AdminRouteErrorState with a retry mechanism."
        },
        {
          "path": "frontend/src/routeTree.tsx",
          "operation": "modify",
          "description": "Ensure the /admin route at path \"/admin\" stays registered under TanStack Router and is wired to the updated AdminDashboardPage that contains the non-blank admin gate + error handling (keep hash routing behavior unchanged)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify the router continues to use createHashHistory and that no routing changes inadvertently break direct \"/#/admin\" navigation; adjust only if needed to preserve hash routing and improve resilience."
        }
      ]
    },
    {
      "id": "REQ-45",
      "summary": "Ensure all Admin entry points (TopNav and Footer) navigate to the hash-based /admin route reliably in production without relying on server rewrites.",
      "acceptanceCriteria": [
        "Clicking the \"Admin\" link in the top navigation always navigates to the admin route and displays the admin gate UI.",
        "The Footer \"Admin\" quick link continues to point to the hash route format \"/#/admin\" and successfully loads the admin gate UI.",
        "Directly entering the URL with hash format \"/#/admin\" loads the admin gate UI without requiring any additional navigation steps."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/TopNav.tsx",
          "operation": "modify",
          "description": "Audit and harden the TopNav Admin navigation to ensure it always routes via TanStack Router to \"/admin\" (hash history) and never results in a non-rendering admin screen."
        },
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Verify the Footer Admin quick link remains in hash format \"/#/admin\" and continues to work in production builds; adjust link implementation only if needed to guarantee consistent navigation."
        },
        {
          "path": "frontend/src/components/auth/AdminSignInPrompt.tsx",
          "operation": "modify",
          "description": "Confirm the post-login redirect behavior reliably returns users to the hash-routed \"/admin\" view and triggers the admin gate UI (loading/sign-in/denied/dashboard) without requiring extra navigation steps."
        }
      ]
    },
    {
      "id": "REQ-46",
      "summary": "Replace indefinite 'Verifying access...' behavior with a clear error + retry state when admin auth/role/profile checks fail (e.g., backend unreachable), while preserving normal loading/unauth/denied behavior.",
      "acceptanceCriteria": [
        "If role/profile verification cannot complete due to an error, /admin shows a non-blocking error state (English text) with a retry action.",
        "The loading state on /admin does not persist forever without any user feedback; the UI provides an actionable next step (retry and/or sign out/sign in again).",
        "Existing three-state behavior (loading, unauthenticated prompt, authenticated non-admin denied) remains intact for normal successful cases."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuth.ts",
          "operation": "modify",
          "description": "Extend useAuth to surface role/profile query failure signals (error state) and expose a retry/refetch capability so the /admin gate can present actionable troubleshooting instead of spinning indefinitely."
        },
        {
          "path": "frontend/src/components/auth/RequireAdmin.tsx",
          "operation": "modify",
          "description": "Update the RequireAdmin gate to detect auth/role/profile verification failures and render a clear English error state with a retry action (and optional sign-out/sign-in guidance), while keeping the existing loading, unauthenticated prompt, and access denied behaviors for successful cases."
        },
        {
          "path": "frontend/src/components/auth/AdminRouteErrorState.tsx",
          "operation": "modify",
          "description": "Enhance the /admin error UI to support retrying role/profile verification (not just render-time errors) and to provide clear next steps when the backend is unreachable or verification fails."
        }
      ]
    }
  ]
}